# Prepare Work Environment

In [ ]:
pip install sqlalchemy==1.4.4

In [ ]:
%load_ext sql

In [ ]:
%sql mysql+pymysql://root:kilonzo1998@localhost:3306/md_water_services

# Import the Auditor Report and Start Anaysis

In [ ]:
%%sql

SELECT 
	a.location_id AS Audit_Location,
	v.location_id AS Visit_Location,
	a.true_water_source_score,
	v.record_id
FROM 
	md_water_services.auditor_report AS a
JOIN
	visits AS v
ON 
	v.location_id = a.location_id;

In [ ]:
%%sql

SELECT 
	wq.subjective_quality_score,
    vt.AuditLocation,
	vt.VisitLocation,
	vt.true_water_source_score,/*I was making a mistake in this code by not referencng the subquerry in the outerquerry
I was also failing to rename the columns as remamed in the subquerry, repetitively landing to errors*/
	vt.record_id
FROM 
	md_water_services.water_quality AS wq
JOIN
	(SELECT 
		a.location_id AS AuditLocation,
		v.location_id AS VisitLocation,
		a.true_water_source_score,
		v.record_id
	FROM 
		md_water_services.auditor_report AS a
	JOIN
		visits AS v
	ON 
		v.location_id = a.location_id) AS vt
ON 
	vt.record_id = wq.record_id;

In [ ]:
#Removing one of the location columns and renaming the scores.

In [ ]:
%%sql

SELECT 
	vt.VisitLocation AS location_id,
    vt.record_id,
    wq.subjective_quality_score AS surveyor_score,
	vt.true_water_source_score AS auditor_score
FROM 
	md_water_services.water_quality AS wq
JOIN
	(SELECT 
		a.location_id AS AuditLocation,
		v.location_id AS VisitLocation,
		a.true_water_source_score,
		v.record_id
	FROM 
		md_water_services.auditor_report AS a
	JOIN
		visits AS v
	ON 
		v.location_id = a.location_id) AS vt
ON 
	vt.record_id = wq.record_id;

In [ ]:
%%sql

SELECT 
	vt.VisitLocation AS location_id,
    vt.record_id,
    wq.subjective_quality_score AS surveyor_score,
	vt.true_water_source_score AS auditor_score
FROM 
	md_water_services.water_quality AS wq
JOIN
	(SELECT 
		a.location_id AS AuditLocation,
		v.location_id AS VisitLocation,
		a.true_water_source_score,
		v.record_id
	FROM 
		md_water_services.auditor_report AS a
	JOIN
		visits AS v
	ON 
		v.location_id = a.location_id) AS vt
ON 
	vt.record_id = wq.record_id
WHERE 
    wq.subjective_quality_score = vt.true_water_source_score;

In [ ]:
#Deduplicating the results to only have locations that were visited once.
#It is important to note that this additional WHERE clause had to be fitted inside the subquery not in the outerquuerry
#This enables SQL to search in the specified table 
#putting it at the end of the code was not reasonable because the outerquerry does not concern the visits table.

In [ ]:
%%sql

SELECT 
	vt.VisitLocation AS location_id,
    vt.record_id,
    wq.subjective_quality_score AS surveyor_score,
	vt.true_water_source_score AS auditor_score
FROM 
	md_water_services.water_quality AS wq
JOIN
	(SELECT 
		a.location_id AS AuditLocation,
		v.location_id AS VisitLocation,
		a.true_water_source_score,
		v.record_id
	FROM 
		md_water_services.auditor_report AS a
	JOIN
		visits AS v
	ON 
		v.location_id = a.location_id
        AND v.visit_count = 1) AS vt
ON 
	vt.record_id = wq.record_id
WHERE 
    wq.subjective_quality_score = vt.true_water_source_score;

In [ ]:
#Computing the percentage of the rows where surveyor score is equals to the auditor scores.
(1518/1620)*100

In [ ]:
#Instances where surveyor score was not equal to auditor scores
(102/1620)*100

In [ ]:
%%sql

SELECT 
	vt.VisitLocation AS location_id,
    vt.record_id,
    wq.subjective_quality_score AS surveyor_score,
	vt.true_water_source_score AS auditor_score
FROM 
	md_water_services.water_quality AS wq
JOIN
	(SELECT 
		a.location_id AS AuditLocation,
		v.location_id AS VisitLocation,
		a.true_water_source_score,
		v.record_id
	FROM 
		md_water_services.auditor_report AS a
	JOIN
		visits AS v
	ON 
		v.location_id = a.location_id
        AND v.visit_count = 1) AS vt
ON 
	vt.record_id = wq.record_id
WHERE 
    wq.subjective_quality_score != vt.true_water_source_score;

In [ ]:
#Comparing water sources and the different scores to make inferences on where the discrepancies are emanating from!

In [ ]:
%%sql

SELECT
    qq.location_id,
    qq.auditor_source,
    s.type_of_water_source AS survey_source,
    qq.record_id,
    qq.auditor_score,
    qq.surveyor_score
FROM 
    md_water_services.water_source AS s
JOIN
        (SELECT 
            vt.VisitLocation AS location_id,
            vt.record_id,
            vt.source_id,
            vt.auditor_score,
            vt.auditor_source,
            wq.subjective_quality_score AS surveyor_score
        FROM 
            md_water_services.water_quality AS wq
        JOIN
            (SELECT 
                a.location_id AS AuditLocation,
                v.location_id AS VisitLocation,
                v.record_id,
                v.source_id,
                a.true_water_source_score AS auditor_score, 
                a.type_of_water_source AS auditor_source
            FROM 
                md_water_services.auditor_report AS a
            JOIN
                visits AS v
            ON 
                v.location_id = a.location_id
                AND v.visit_count = 1) AS vt
        ON 
            vt.record_id = wq.record_id
        WHERE 
            wq.subjective_quality_score != vt.auditor_score) AS qq
ON
    s.source_id = qq.source_id;

In [ ]:
#Checking which employee specifically made the erroneous data capture and entry.

In [ ]:
%%sql

SELECT 
	vt.VisitLocation AS location_id,
    vt.record_id,
    wq.subjective_quality_score AS surveyor_score,
	vt.true_water_source_score AS auditor_score,
    vt.assigned_employee_id
FROM 
	md_water_services.water_quality AS wq
JOIN
	(SELECT 
		a.location_id AS AuditLocation,
		v.location_id AS VisitLocation,
		a.true_water_source_score,
		v.record_id,
        v.assigned_employee_id
	FROM 
		md_water_services.auditor_report AS a
	JOIN
		visits AS v
	ON 
		v.location_id = a.location_id
        AND v.visit_count = 1) AS vt
ON 
	vt.record_id = wq.record_id
WHERE 
    wq.subjective_quality_score != vt.true_water_source_score;

In [ ]:
#Get their names!

In [ ]:
%%sql

SELECT
    qi.location_id,
    qi.record_id,
    e.employee_name,
    qi.auditor_score,
    qi.surveyor_score
FROM
    md_water_services. employee AS e
JOIN
    (SELECT 
        vt.VisitLocation AS location_id,
        vt.record_id,
        wq.subjective_quality_score AS surveyor_score,
        vt.true_water_source_score AS auditor_score,
        vt.assigned_employee_id
    FROM 
        md_water_services.water_quality AS wq
    JOIN
        (SELECT 
            a.location_id AS AuditLocation,
            v.location_id AS VisitLocation,
            a.true_water_source_score,
            v.record_id,
            v.assigned_employee_id
        FROM 
            md_water_services.auditor_report AS a
        JOIN
            visits AS v
        ON 
            v.location_id = a.location_id
            AND v.visit_count = 1) AS vt
    ON 
        vt.record_id = wq.record_id
    WHERE 
        wq.subjective_quality_score != vt.true_water_source_score) AS qi
ON 
    qi.assigned_employee_id = e.assigned_employee_id;

In [ ]:
#Checking if the view function correctly from this front. MUST BE NICE!

In [ ]:
%%sql

SELECT
*
FROM 
	incorrect_records;

In [ ]:
#cheking the number of mistakes done by specific employees and create an view: error_count

In [ ]:
%%sql

SELECT DISTINCT
	employee_name,
	COUNT(employee_name) AS number_of_mistakes
FROM 
	md_water_services.incorrect_records
GROUP BY employee_name
ORDER BY COUNT(employee_name) DESC;

Some employees are making signuificant mistakes, let's use average to see whose mistakes are above average.

In [ ]:
%%sql

SELECT 
	AVG(number_of_mistakes)
FROM 
	md_water_services.error_count; #The code indicates that siz is the average error count per employee
    
SELECT DISTINCT
	employee_name, 
    number_of_mistakes
FROM 
	md_water_services.error_count
WHERE
	number_of_mistakes > 6
GROUP BY employee_name
ORDER BY number_of_mistakes DESC;

Using a subquerry, the querry would be as follows shown below.

In [ ]:
%%sql
    
SELECT DISTINCT
	employee_name, 
    number_of_mistakes
FROM 
	md_water_services.error_count
WHERE
	number_of_mistakes > 
                        (SELECT 
                            AVG(number_of_mistakes)
                        FROM 
                            md_water_services.error_count)
GROUP BY employee_name
ORDER BY number_of_mistakes DESC;

Lets convert it to a CTE to make querrying from the it easy. This CTE we reffer to it as the suspect list. 
#This querry renames our previous querry to suspect_list as a CTE
#We can querry with suspect_list while reffering to the list of the suspected employees

In [ ]:
%%sql

WITH suspect_list AS(
        SELECT DISTINCT
            employee_name, 
            number_of_mistakes
        FROM 
            md_water_services.error_count
        WHERE
            number_of_mistakes > 
                                (SELECT 
                                    AVG(number_of_mistakes)
                                FROM 
                                    md_water_services.error_count)
        GROUP BY employee_name
        ORDER BY number_of_mistakes DESC)
SELECT
    *
FROM 
    suspect_list;

UPDATE THE incorrect_records table to include the statements column from the auditor_report column

In [ ]:
%%sql

CREATE VIEW md_water_services.incorrect_records
AS
		SELECT
			qi.location_id,
			qi.record_id,
			e.employee_name,
			qi.auditor_score,
			qi.surveyor_score,
            qi.statements
		FROM
			md_water_services. employee AS e
		JOIN
			(SELECT 
				vt.VisitLocation AS location_id,
				vt.record_id,
				wq.subjective_quality_score AS surveyor_score,
				vt.true_water_source_score AS auditor_score,
				vt.assigned_employee_id,
                vt.statements
			FROM 
				md_water_services.water_quality AS wq
			JOIN
				(SELECT 
					a.location_id AS AuditLocation,
					v.location_id AS VisitLocation,
					a.true_water_source_score,
					v.record_id,
					v.assigned_employee_id,
                    a.statements
				FROM 
					md_water_services.auditor_report AS a
				JOIN
					visits AS v
				ON 
					v.location_id = a.location_id
					AND v.visit_count = 1) AS vt
			ON 
				vt.record_id = wq.record_id
			WHERE 
				wq.subjective_quality_score != vt.true_water_source_score) AS qi
		ON 
			qi.assigned_employee_id = e.assigned_employee_id;
SELECT 
*
FROM incorrect_records;

Let's check the statements with the suspects' list. We first create a view of the suspects list

In [ ]:
%%sql

CREATE VIEW suspect_list 
AS
       
    SELECT DISTINCT
            employee_name, 
            number_of_mistakes
        FROM 
            md_water_services.error_count
        WHERE
            number_of_mistakes > 
                                (SELECT 
                                    AVG(number_of_mistakes)
                                FROM 
                                    md_water_services.error_count)
        GROUP BY employee_name
        ORDER BY number_of_mistakes DESC;

We now write a querry using the two views to highlight the statements from locationIDs where the employees in suspect list visited.

In [ ]:
%%sql

SELECT 
	employee_name,
	location_id,
	statements
FROM
	incorrect_records
WHERE
	employee_name IN (
						SELECT employee_name FROM suspect_list);

# Let's inevstigate instances where the statements have the word "cash"

In [ ]:
%%sql

SELECT 
	employee_name,
	location_id,
	statements
FROM
	incorrect_records
WHERE
	employee_name IN (
						SELECT employee_name FROM suspect_list)
	AND statements LIKE "%cash%";

# Let us check whether we are leaving other culprits by checking the word cash in the incorrect records.

In [ ]:
%%sql

SELECT 
	employee_name,
	location_id,
	statements
FROM
	incorrect_records
WHERE
	employee_name NOT IN (
						SELECT employee_name FROM suspect_list)
	AND statements LIKE "%cash%";